'use strict';

// (function(){}()) // Синтаксис самовикликаючої анонімної функції. Необхідні ззовні (), бо інакше це буде рахуватись як function declaration
// Така функція необхідна для створення власного локального поля, щоб зменшити трафік змінних в глобальну видимість
// Це дозволяє економити назви змінних і уникати помилок з повторенням

// const number = 1;

// (function(){
//     const number = 2;
//     console.log(number);
//     console.log(number + 3);    
// }());

// Об'єктний інтерфейс - це коли модуль записується в змінну і в ньому повертаємо методи, доступні ззовні

const user = (function(){
    const privat = function() { // так як функція лежить в локальній області бачення, доступа до її немає
        console.log(`i'm privat`);
    };
    // Об'єктний інтерфейс(ОІ) - це коли ми з цієї анонімної функції ми повертаємо об'єкт
    return { // ОІ повинен повертати лише ті властивості і методи, які рахуються необхідними, для роботи з даним функціоналом
        sayHello: privat,
    };
}());

user.sayHello();