'use strict';

// Будь-який регулярний вираз в js складається з 2 частин. 1 - патерн, 2 - флаги

// new RegExp('pattern', 'flags'); // старий синтаксис, який не використовується
// /pattern/f; // сучасний синтаксис

// const ans = prompt('Input your name');

// const reg = /\d/g;
// console.log(reg.match(ans));

const str = 'My name is R2D2';

console.log(str.match(/\w\d\w\d/i));
//зворотні класи
// \D - не цифри 
// \W - не букви
// \S
//класи
// \d - шукаєм цифри
// \w - шукаєм всі букви
// \s - шукаєм всі пробіли
// шаблони можна комбінувати

// i - flag - знайти щось, вне залежності від реєстру букви
// g - знайти одразу декілька варіантів співпадінь
// m - багатостроковий режим

// Проблема методу search це те що він завжди шукає перше значення, вне залежності чи є флаг g

// console.log(ans.search(reg));
// console.log(ans.match(reg)); // Без флагу g видає дуже детальну інформацію у виді масиву

// const pass = prompt('password');
// console.log(pass.replace(/./g, "*")); // /./g - такий запис означає, що всі символи, які попадуть в інпут промпту, будуть замінені на зірку
// /./ так як в css *{}, то цей запис означає те саме, але для строки
// щоб шукати крапки в строках, потрібно цей запис екранувати /\./

// console.log('12-34-56'.replace(/-/g, ':'));


