'use strict';

const now = new Date(0);

console.log(now);

// Якщо записувати дату в зміну без new то вона буде створювати просто сьогоднішню дату та час
// в date можна передати параметри дати строковим типом або числовим
// get.Month, getFullYear, getDate - методи для отримання дати і ще є інші до їх з годинами, хвилинами, секундами
// get.Hours, minutes, seconds, miliseconds
// Всі дані починаються з 0
// get.UTCHours - 11 get.Hours - 14
// get.Time() - timestamp з 1970 року

//***************

console.log(now.setHours(18)); // 15

// visual studio code орієнтується лише на UTC зону, але не на локальні данні
// Date якщо запускати через браузер, без парамертів буде орієнтуватись на локальні дані
// Date.parse() метод що дозволяє зпарсити дані. нічим не відрізняється від того, якщо задавати параметри напряму в Date
// Date робить це автоматично, а Date.parse() це як альтернативний запис

let start = new Date();

for ( let i = 0; i < 100000; i++){
    let some = i ** 3;
}

let end = new Date();

alert(`Цикл отработал за ${end - start} милисекунд`);

// Являється самим простим шаблоном для бенчмарку проекту, на перевірку завантаження проекту
// де береться дата з початку виконання скрипта чи частини коду, функції і до завершення