'use strict';

const char = {
    name: 'Max',
    age: 21,
    // Аксесори геттер і сеттер відрізняються від звичайних методів тим, що являються не методами об'єктами, а його властивостями
    get charAge(){ // Геттер не потребує () для виклику навідміну від метода. Тому його виклик виглядає як виклик властивості char.charAge
        return this.age;
    },

    set charAge(age){ // Сеттер повинен приймати в себе параметри і працює виключно разом з гетером
        this.age = age;
    }
};

console.log(char.charAge);
