'use strict';

const user = {
    name: 'Max',
    surname: 'Smith',
    birthday: '13/06/2001',
    showMyPublicData: function() {
        console.log(`${this.name} ${this.name}`);
    }
}

const userMap = new Map(Object.entries(user));
console.log(userMap);

// Головні відміності між МАП та ОБЄКТОМ
// 1. В меп ключі можуть бути всіма типами даних
// 2. В меп купа варіанів перебору і роботу з типом даних меп
//  - Щоб порахувати кількість елементів в меп, достатньо map.keys, в той час коли в об'єкті потрібно
//  всі ключі винести в окремий масив завдяки Object.keys а лише потім порахувати довижну масиву
// 3. В меп елементи додаються строго по порядку
// 4. Меп являється ітеруємим, в той час коли звичайний об'єкт повинен мати метод некст для ітерації, інакше неможливо його ітерувати
// 5. При створені меп, в ній нічого не буде, навіть при наслідувані через _prototype_, в той час як об'єкті будуть

// Всі числа в властивостях перетворюються в тип даних string
// Переваги MAP перед об'єктами в тому, що в властивості можуть бути записані будь-які типи даних

const shops = [
    {rice: 500},
    {toys: 230},
    {shampoo: 177},
]
const budget = [5000, 33552, 54392];
const map = new Map();
// можна передати в меп базове значення, але воно повино притримуватись стандарту масив масивів
const map1 = new Map([
    [{glass: 5001}, 400010]
])
shops.forEach((shop, i) => {
    map.set(shop, budget[i]);
})
// map.set(shops[0], 5000); // Приймає 2 значення. Ключ-значення
// map.set(shops[1], 15000); // Приймає 2 значення. Ключ-значення
// map.set(shops[2], 35000); // Приймає 2 значення. Ключ-значення

// map.set(shops[0], 5000)
//     .set(shops[1], 33223)
//     .set(shops[2], 55355); 

// console.log(map);
// console.log(map.get(shops[0])); // get отримує значення з об'єкту меп. Повертає саме значення
// console.log(map.has(shops[0])); // перевіряє меп на наявність чогось всередині карти. Повертає значення true або false
// map.delete(key); // видаляє елемент з карти
// map.clear(); // очищує мапу
// // map.size; // кількість елементів в карті на даний момент

// // Відображення меп насправді не таке яким являється. Консоль показує що це об'єкт об'єктів, але насправді це масив масивів

// // map.keys();
// // for(let shop of map.keys()){
// //     console.log(shop);
// // }

// const goods = [];
// for(let shop of map.keys()){
//     goods.push(Object.keys(shop)[0]);
// }
// console.log(goods);
// // Перебираємо ключі об'єктів і додаємо їх в окремий масив
// // Завдання полягає в тому щоб винести в окремий масив всі товари нашого магазину

// for( let price of map.values()){
//     console.log(price);
// }

// for(let [shop, price] of map.entries()){
//     console.log(shop, price);
// }

map.forEach((value, key, map) =>{
    console.log(key, value);
})