import {one, two} from './main'; 
import sayHi from './main';
// import {one as first} from './main'; // Один з плюсів такого синтаксису, це те що можна окремі змінні перейменувати

// import * as data from './main'; // для імпорту всього контенту файлу, використовується * і створюється об'єкт, в якій розміщуються всі сущності файлу

console.log(`${one}, ${two}`); // Ці імпорти так само треба збирати завдяки зборщику, бо браузер невміє збирати це все в 1 проект
sayHi();
// в модулях є експорт за замовчуванням, завдяки ключовому слову default і може існувати лише 1 такий