'use strict';

// defer - продовжує обробляти та завантажувати скріпт в фоновому режимі а потім запустити коли він запуститься
// скрипти з дефер ніколи не блокують сторінку. Скріпти завантажуються в фоновому режимі
// скрипти з дефер виконується лише тоді коли дом дерево прогрузилось і вони зпрацьовують до DOMcontentLoad
// завантажуються скрипти послідовно

// async - скрипти з асинк завантажуються відокремлено один від одного
// Це необхідно для скриптів які не працюють з дом деревом на пряму

const script = document.createElement('script');
script.src = 'js/test.js';
document.body.append('script');

script.async = false; // Вимикає динамічне/асинхроне завантаження скриптів. Таким чином вони будуть завантажуватися строго один за одним